#问题3-1，数字的三个内置类的名称是什么？
#浮点值numeric、整数integer和复数complex
#问题3-2，用什么函数查找了因子的水平值？
#levels()
#问题3-3，如何把字符串“6.283185”转换为数字？
#as.numeric()
#问题3-4，指出至少三个用于检视变量内容的函数。
#print();summary();attributes()
#问题3-5，如何删除用户工作区中的所有变量？
#rm()



#练习3??
c类ss(Inf)
#[1] "numeric"
class(NA)
#[1] "logical"
class(NaN)
#[1] "numeric"
class("")
#[1] "character"
#????类型eof(Inf)
#[1] "double"
typeof(NA)
#[1] "logical"
typeof(NaN)
#[1] "double"
typeof("")
#[1] "character"



#


x<-dox","cat","dolphin","hamster","goldfish")
fac<-sample(x,100,replace = TRUE)
#[1] "cat"  olphin"  oldfish"
#[4] "hamster"  og"  at"     
#[7] "hamster"  og"  olphin" 
#[10] "hamster"  "cat"      "dolphin" 
#[13] "hamster"  "hamster"  "dog"     
summary(fac)#?Ϳμ??ķ??ؽ?????ͬ
#Length     Class      Mode 
#100 character character 



#��ϰ3-3
练习234
banana<-"shu"
pear<-8485
ls(pattern = "a")
#[1]"apple"  "banana"   "pear"



#��ϰ4-1
a<#问题4-1，你将如何创建一个包含值0、0.25、0.5、0.75和1的向量？
xiangliang<-seq.int(0,1,0.25)

#问题4-2，描述两种命名向量元素的方式。
#c(name = value);x<-c(...) name(x)<-c(...)

#问题4-3，向量索引中的四种类型是什么？
#对于向量x[]
#给向量传入正数，它会返回此位置上的向量元素。它的第一个位置是1 （而不像其他某些语言一样是0,如python） 。
#给向量传入负数，它会返回一个向量，它将包含除了这些位置以外的所有元素。
#给向量传入一个逻辑向量，它会返回一个向量，里面只包含索引为TRUE的元素。
#对于已命名的向量，给向量传入命名的字符向量，将会返回向量中包含这些名字的元素。

#问题4-4，一个3×4×5的数组的长度是多少？
#60

#问题4-5，你会用哪个操作符来执行两个矩阵的内积？-#%*%



c练习<-c(2:51)
triangle<-a*b/2
names(triangle)<-c(letters[1:15])#��????��????ͬ??两个数量不一样"o")]




#��ϰ4-2
h<-c(11:0,1:11)
练习????21??21?ľ???



#��ϰ5-1并不是一个21×21的矩阵-s#问题5-1以下列表的长度是多少？
dfgh<-list(alpha = 1, list(beta = 2, gamma = 3, delta = 4), eta = NULL)
length(dfgh)
#问题5-2你会在哪里找到成对列表？
#formals
#问题5-3尽可能多地说出的几种创建数据框子集的方法。
#data[num,num]
#subset需要三个参数：一个数据框，一个行的条件逻辑向量，以及一个需要保留的名字向量
#问题5-4如何创建一个数据框，使得它的列名既非唯一又非有效？
#给 data.frame 传入check.names = FALSE关闭：
#问题5-5你会使用哪个函数将一个数据框追加到另一个之后？q#rbind()r
t练习quare<-umber<-sqrt_t==floor(sqrt_t)
square_numbers<-t[is_square_number]
groups<-cut(
  square_numbers,
  seq.int(min(t),max(t),10),
  include.lowest = TRUE,
  right = FALSE)
split(square_numbers,groups)


#��ϰ5-2
(a_data_fram,<-data.frm练习ris[1],
  y=iris[2],
  z=iris[3],
  k=iris[4]
))
colMeans(a_data_frame)
#Sepal.Length  Sepal.Width Petal.Length 
#5.843333     3.057333     3.758000 
#Petal.Width 
#1.199333 


#��ϰ5-3
weeer<-beaver1
sdffg<-data.f练习rep(1,each=114))
new_beaver1<-cbind(sdffg,weeer)
wyyyyr<-beaver2
sdgggg<-data.frame(id=rep(2,each=100))
new_beaver2<-cbind(sdgggg,wyyyyr)
new_beaver<-rbind(new_beaver1,new_beaver2)
subset(new_beaver,activ>0)
#    id day time  temp activ
#54   1 346 1730 37.07     1
#68   1 346 1950 37.10     1
#80   1 346 2150 37.53     1
#83   1 346 2230 37.25     1
#86   1 346 2300 37.24     1
#114  1 347  340 37.15     1
#153  2 307 1550 37.98     1
#154  2 307 1600 38.02     1
#155  2 307 1610 38.00     1
#156  2 307 1620 38.24     1
#157  2 307 1630 38.10     1
#158  2 307 1640 38.24     1
#159  2 307 1650 38.11     1
#160  2 307 1700 38.02     1
#161  2 307 1710 38.11     1
#162  2 307 1720 38.01     1
#163  2 307 1730 37.91     1
#164  2 307 1740 37.96     1
#165  2 307 1750 38.03     1
#166  2 307 1800 38.17     1
#167  2 307 1810 38.19     1
#168  2 307 1820 38.18     1
#169  2 307 1830 38.15     1
#170  2 307 1840 38.04     1
#171  2 307 1850 37.96     1
#172  2 307 1900 37.84     1
#173  2 307 1910 37.83     1
#174  2 307 1920 37.84     1
#175  2 307 1930 37.74     1
#176  2 307 1940 37.76     1
#177  2 307 1950 37.76     1
#178  2 307 2000 37.64     1
#179  2 307 2010 37.63     1
#180  2 307 2020 38.06     1
#181  2 307 2030 38.19     1
#182  2 307 2040 38.35     1
#183  2 307 2050 38.25     1
#184  2 307 2100 37.86     1
#185  2 307 2110 37.95     1
#186  2 307 2120 37.95     1
#187  2 307 2130 37.76     1
#188  2 307 2140 37.60     1
#189  2 307 2150 37.89     1
#190  2 307 2200 37.86     1
#191  2 307 2210 37.71     1
#192  2 307 2220 37.78     1
#193  2 307 2230 37.82     1
#194  2 307 2240 37.76     1
#195  2 307 2250 37.81     1
#196  2 307 2300 37.84     1
#197  2 307 2310 38.01     1
#198  2 307 2320 38.10     1
#199  2 307 2330 38.15     1
#200  2 307 2340 37.92     1
#201  2 307 2350 37.64     1
#202  2 308    0 37.70     1
#203  2 308   10 37.46     1
#204  2 308   20 37.41     1
#205  2 308   30 37.46     1
#206  2 308   40 37.56     1
#207  2 308   50 37.55     1
#208  2 308  100 37.75     1
#209  2 308  110 37.76     1
#210  2 308  120 37.73     1
#211  2 308  130 37.77     1
#212  2 308  140 38.01     1
#213  2 308  150 38.04     1
#214  2 308  200 38.07     1